var Config = require('../../../config/index');

//-----------------------------------------------------------------------------------------------
//
//
//
//
//
//-----------------------------------------------------------------------------------------------
var LoadBalance = function () {
    this.providerWeightMap = {};
    this.init();
};


//-----------------------------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------------------------
LoadBalance.prototype.init = function () {
};

//-----------------------------------------------------------------------------------------------
// 设置权重
//-----------------------------------------------------------------------------------------------
LoadBalance.prototype.setProviderWeight = function (invokerDesc, providerHost, weight) {
    this.providerWeightMap[invokerDesc.toString() + '_' + providerHost] = weight;
};

//-----------------------------------------------------------------------------------------------
// 获取权重
//-----------------------------------------------------------------------------------------------
LoadBalance.prototype.getProviderHostWeight = function (invokerDesc, providerHost) {
    return this.providerWeightMap[invokerDesc.toString() + '_' + providerHost] || Config.getDefaultWeight();
};

//-----------------------------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------------------------
LoadBalance.prototype.getProvider = function (invokerDesc, providerList) {
    if (providerList.length <= 1) {
        return providerList[0];
    }
    else {
        return this._getProvider(invokerDesc, providerList);
    }
};

//-----------------------------------------------------------------------------------------------
// 子类走着
//-----------------------------------------------------------------------------------------------
LoadBalance.prototype._getProvider = function (invokerDesc, providerList) {
    console.warn('LoadBalance : 不要用默认类, 这个只会返回第一个提供者');
    return providerList[0];
};

//-----------------------------------------------------------------------------------------------
//
//
//
//
//
//-----------------------------------------------------------------------------------------------
module.exports = LoadBalance;